export const codeMessage = {
  tokenMsg: {
    100001001: '缺少token',
    100001002: 'token解析错误',
    100001003: 'token失效',
    100001004: 'token和用户不匹配，非法授权信息',
    100001005: '生成token失败',
    200000020: '接口授权失败',
    200000021: 'jwt 解析错误',
    200000022: 'jwt 无效',
    200001002: '用户不存在'
  },
  authorityMsg: {
    100004001: '用户对资源无权限',
    100004002: '请求来自未经授权的IP地址'
  },
  otherMsg: {
    100002001: '缺少参数',
    100002002: '参数格式错误',
    100002003: '参数不可用',
    100003001: '服务器内部错误',
    100005001: 'JSON格式错误',
    100006001: '数据库错误',
    100006002: 'redis key 错误',
    100006003: 'Redis连接错误',
    100007001: '数据格式错误',
    100007002: '数据校验失败',
    100008001: '第三方短信服务接口出错',
    100400404: '请求地址无效',
    100400405: '请求太频繁',
    200000002: '无效连接',
    200000012: '数据库操作错误',
    200000010: 'redis 写入错误',
    200000011: '请求参数错误',
    200000040: '第三方接口错误',
    200000041: '第三方接口获取数据失败',
    200000031: 'token不能为空',
    200000030: '参数不能为空',
    400: '发出的请求有错误，服务器没有进行新建或修改数据的操作。',
    401: '用户没有权限（令牌、用户名、密码错误）。',
    403: '用户得到授权，但是访问是被禁止的。',
    404: '发出的请求针对的是不存在的记录，服务器没有进行操作。',
    406: '请求的格式不可得。',
    410: '请求的资源被永久删除，且不会再得到的。',
    422: '当创建一个对象时，发生一个验证错误。',
    500: '服务器发生错误，请检查服务器。',
    502: '网关错误。',
    503: '服务不可用，服务器暂时过载或维护。',
    504: '网关超时。'
  },
  specialMsg: {
    101000001: '用户名密码错误，请检查后重试',
    101000012: '用户名不存在，请检查你的用户名',
    101000007: '该手机号还未注册，现在去注册',
    101000006: '该手机号未绑定，请通过用户名找回密码',
    101000013: '暂时无法修改，请稍后再试',
    100009004: '获取验证码太频繁，请稍后再试'
  }
};
